<a id=section1></a>

# Mobile Services Usage - Capstone project

### Week 1

- Fetch the Data on to Python Notebook by connecting to the provided MySQL instance. 
- Ponder upon the challenges present in Data and list the observations.

<a id=section2></a>

### 1. Import libraries

In [1]:
import numpy as np                                            # Implemennts milti-dimensional array and matrices
import pandas as pd                                           # For data manipulation and analysis
import mysql.connector                                        #Connect mysql
import warnings
warnings.filterwarnings("ignore")

### 2. Connect to mysql server and download the data

In [2]:
#Establish connection
dbconnect = mysql.connector.connect(host="cpanel.insaid.co", user="student", passwd="student", database="Capstone1")

In [3]:
if dbconnect.is_connected():
        db_Info = dbconnect.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = dbconnect.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)

Connected to MySQL Server version  5.6.46-cll-lve
You're connected to database:  ('Capstone1',)

In [4]:
#Get the tables in the database
db_cursor = dbconnect.cursor()
db_cursor.execute("SHOW TABLES")
for table in db_cursor:
        print(table)

('events_data',)
('gender_age_train',)
('phone_brand_device_model',)

In [ ]:
#Download table 'events_data'
table = 'events_data'
query = "SELECT * FROM %s;" % table
results = pd.read_sql_query(query, dbconnect)
results.to_csv('D://DataBase//events_data.csv')

In [ ]:
#Download table 'gender_age_train'
table = 'gender_age_train'
query = "SELECT * FROM %s;" % table
results = pd.read_sql_query(query, dbconnect)
results.to_csv('D://DataBase//gender_age_train.csv')

In [ ]:
#Download table 'phone_brand_device_model'
table = 'phone_brand_device_model'
query = "SELECT * FROM %s;" % table
results = pd.read_sql_query(query, dbconnect)
results.to_csv('D://DataBase//phone_brand_device_model.csv')

In [ ]:
#Close MySql connection
cursor.close()

### 3. Load and explore the data

In [6]:
#Importing dataset using pd.read_csv
agt = pd.read_csv('D://DataBase//Telecom_Capstone//gender_age_train.csv', encoding="utf-8")
events = pd.read_csv('D://DataBase//Telecom_Capstone//events_data.csv', encoding="utf-8")
brand = pd.read_csv('D://DataBase//Telecom_Capstone//phone_brand_device_model.csv', encoding="utf-8")

In [7]:
agt.head()                                                  #Gives the first five rows of gender_age_train

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31

In [8]:
agt.shape

(74645, 4)

In [9]:
agt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74645 entries, 0 to 74644
Data columns (total 4 columns):
device_id    74645 non-null int64
gender       74645 non-null object
age          74645 non-null int64
group        74645 non-null object
dtypes: int64(2), object(2)
memory usage: 2.3+ MB

In [16]:
agt.isnull().sum()

device_id    0
gender       0
age          0
group        0
dtype: int64

In [10]:
events.head()                                                  #Gives the first five rows of events_data

,event_id,device_id,timestamp,longitude,latitude,city,state
0,1.0,2.918269e+16,2016-05-01 00:55:25,77.266049,28.68161,Delhi,Delhi
1,7104.0,2.918269e+16,2016-05-02 09:37:02,77.266049,28.68161,Delhi,Delhi
2,29661.0,2.918269e+16,2016-05-04 00:56:04,77.266049,28.68161,Delhi,Delhi
3,33133.0,2.918269e+16,2016-05-06 05:01:15,77.266049,28.68161,Delhi,Delhi
4,38980.0,2.918269e+16,2016-05-06 09:55:04,77.266049,28.68161,Delhi,Delhi

In [11]:
events.shape

(3252950, 7)

In [12]:
events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3252950 entries, 0 to 3252949
Data columns (total 7 columns):
event_id     float64
device_id    float64
timestamp    object
longitude    float64
latitude     float64
city         object
state        object
dtypes: float64(4), object(3)
memory usage: 173.7+ MB

In [17]:
events.isnull().sum()

event_id       0
device_id    453
timestamp      0
longitude    423
latitude     423
city           0
state        377
dtype: int64

In [19]:
events[(events['device_id'].isnull())]

,event_id,device_id,timestamp,longitude,latitude,city,state
23808,72957.0,NaN,2016-05-03 06:10:14,77.303153,28.728888,Delhi,Delhi
23820,78897.0,NaN,2016-05-02 11:25:47,77.303153,28.728888,Delhi,Delhi
23831,94768.0,NaN,2016-05-02 17:39:12,77.303153,28.728888,Delhi,Delhi
23852,127677.0,NaN,2016-05-01 10:06:53,77.303153,28.728888,Delhi,Delhi
24093,442470.0,NaN,2016-05-07 09:03:18,77.303153,28.728888,Delhi,Delhi
...,...,...,...,...,...,...,...
3098746,1882296.0,NaN,2016-05-01 13:17:54,73.169345,21.194283,Bardoli,Gujarat
3098757,1952481.0,NaN,2016-05-05 00:53:42,73.169345,21.194283,Bardoli,Gujarat
3098801,2235564.0,NaN,2016-05-01 12:43:58,73.169345,21.194283,Bardoli,Gujarat
3098833,2452592.0,NaN,2016-05-02 13:34:20,73.169345,21.194283,Bardoli,Gujarat
3098901,3050759.0,NaN,2016-05-05 01:02:21,73.169345,21.194283,Bardoli,Gujarat

In [20]:
events['device_id'].nunique()

60865

In [21]:
events['event_id'].nunique()

3252950

In [13]:
brand.head()                                                  #Gives the first five rows of phone_brand_device_model

             device_id phone_brand device_model
0  1877775838486905855        vivo          Y13
1 -3766087376657242966          小米         V183
2 -6238937574958215831        OPPO          R7s
3  8973197758510677470          三星        A368t
4 -2015528097870762664          小米      红米Note2

In [14]:
brand.shape

(87726, 3)

In [15]:
brand.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87726 entries, 0 to 87725
Data columns (total 3 columns):
device_id       87726 non-null int64
phone_brand     87726 non-null object
device_model    87726 non-null object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [18]:
brand.isnull().sum()

device_id       0
phone_brand     0
device_model    0
dtype: int64

### Observations

1.  There are null/zeros in "device_id" of events_data which should not be the case.
2.	There are null/zeros in "latitude" and "longitude".
3.	Some of the "latitudes" and "longitudes" are wrong.
4.	"state" column of events_data has null values in the DataBase. Retrieve those rows and fill them appropriately.
5.	Phone brand and device models got some non-English names which need translation.

<a id=section3></a>